#!/usr/bin/env python
# -*- coding: utf-8 -*-


"""
题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，低于10万元的部分按10%提成，
高于10万元的部分，可提成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成3%；60万到100万
之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？
"""


def jiangjin(i):
    if i > 100:
        total = (i-100) * 0.01 + (40 * 0.015) + (20 * 0.03) + (20 * 0.05) + (10 * 0.075) + (10 * 0.1)
    elif 60 < i <= 100:
        total = ((i-60) * 0.015) + (20 * 0.03) + (20 * 0.05) + (10 * 0.075) + (10 * 0.1)
    elif 40 < i <= 60:
        total = ((i-40) * 0.03) + (20 * 0.05) + (10 * 0.075) + (10 * 0.1)
    elif 20 < i <= 40:
        total = ((i-20) * 0.05) + (10 * 0.075) + (10 * 0.1)
    elif 10 < i <= 20:
        total = ((i-10) * 0.075) + (10 * 0.1)
    else:
        total = i * 0.1
    return total


i = int(input("请输入利润:"))
result = jiangjin(i)
print("你的提成为:%f" % (result))